W8D1/reddit_clone/app/views/posts/new.html.erb

SELECT "posts".* FROM "posts"
---

<% Post.all.each do |post| %>