W8D1/reddit_clone/app/controllers/application_controller.rb

SELECT "subs".* FROM "subs" WHERE "subs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def is_moderator?
        @sub = Sub.find_by(id: params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def is_author?
        @user = User.find_by(id: params[:id])