W8D1/reddit_clone/app/controllers/subs_controller.rb

    def create
        @sub = current_user.subs.new(sub_params)

        if @sub.save
---
INSERT INTO "subs" ("title", "description", "author_id") VALUES (?, ?, ?)  [["title", "Vampire"], ["description", "asdfasdrf"], ["author_id", 3]]