W8D1/reddit_clone/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "TpAA03ySsi9qhmuZlbwTpw"], ["updated_at", "2020-06-29 19:16:56.614000"], ["id", 1]]
---
    def create
        @user = User.create(user_params)

        if @user.save