W7D2/music_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "brandon"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, password) #passed in as strings in params { user => {username: x, password: y}
        #must be a class method because it User.find_by method and done to find an instance of user
        user = User.find_by(email: email)  #checking to see if email is in DB