W6D3/first_routes/app/controllers/artworks_controller.rb

SELECT DISTINCT * FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artworks.artist_id = '9' OR artwork_shares.viewer_id = '9')
---
    def index
        if params.has_key?(:user_id) #params is a hash like object that has parameters from get request (clarify with ta)
            @artworks = Artwork
                .select('DISTINCT *')
                .joins(:artwork_shares)
                .where('artworks.artist_id = :id OR artwork_shares.viewer_id = :id', id: params[:user_id]) #might be artist_id and would be user's artwork, and would be hash-like object