W6D3/first_routes/app/controllers/artworks_controller.rb

    def show
        @artwork = Artwork.find_by(id: params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "hello"], ["image_url", "https://www.google.com/images?=hello"], ["artist_id", 5]]