W7D2/music_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def current_user #to know what user is the current user, we'd look for matching session_token in our database
        @current_user ||= User.find_by(session_token: session[:session_token])  #User has a session_token that you can query