W7D2/music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "greenday"], ["created_at", "2020-06-23 20:50:29.533653"], ["updated_at", "2020-06-23 20:50:29.533653"]]
---
    def create
        @band = Band.create(valid_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def edit #you get :id (wildcard) and render
        @band = Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "john"], ["updated_at", "2020-06-23 20:55:37.239282"], ["id", 2]]
---
    def update
        @band = Band.find_by(id: params[:id])

        if @band.update(valid_params)