W7D2/music_app/app/controllers/users_controller.rb

    def create
        @user = User.create(valid_params)
---
INSERT INTO "users" ("email", "session_token", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["email", "brandon"], ["session_token", "SQZg1LDujggQ1zUVPV42ng"], ["password_digest", "$2a$12$oXp3zKY10p5s.hy47OdJguFju17PY0KXTYWN3MAIUAxoe.nbban1K"]]